---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.SpecificHeatCapacity
source: html/030bc541-7a49-e827-6452-fe9b6917288d.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.SpecificHeatCapacity Property

The specific heat capacity of the material.

## Syntax (C#)
```csharp
public double SpecificHeatCapacity { get; }
```